def solution(game_board, table):
    answer = -1
    return answer

'''
    Step1. 
        game board -> 빈칸 모양 list
        table -> 빈칸 모양 list
        


def 빈칸모양 직사각형 으로 잘라주는 함수

def 빈칸모양 별 set 찾아주는 함수

'''


if __name__ == '__main__':
    game_board = [
        [1,1,0,0,1,0],
        [0,0,1,0,1,0],
        [0,1,1,0,0,1],
        [1,1,0,1,1,1],
        [1,0,0,0,1,0],
        [0,1,1,1,0,0]]
    table = [
        [1,0,0,1,1,0],
        [1,0,1,0,1,0],
        [0,1,1,0,1,1],
        [0,0,1,0,0,0],
        [1,1,0,1,1,0],
        [0,1,0,0,0,0]
        ]